import {
  faFacebookF,
  faInstagram,
  faSnapchat,
  faWhatsapp,
} from '@fortawesome/free-brands-svg-icons'
import '@fortawesome/fontawesome-svg-core/styles.css'
import { faPhone } from '@fortawesome/free-solid-svg-icons'

export const NavLinks = [
  {
    id: 1,
    name: 'الرئيسية',
    url: '/',
  },
  {
    id: 2,
    name: 'خدمات',
    url: '/services',
  },
  {
    id: 3,
    name: 'حول شركتنا',
    url: '/about',
  },
  {
    id: 4,
    name: 'المدونة',
    url: '/blog',
  },
  {
    id: 5,
    name: 'الاتصال',
    url: '/contact',
  },
]

export const SiteInfo = {
  title: `شراء جميع الأثاث المستعمله اجهزاء كهربائي غرفه نوم مطابخ كنب مكيفات معدات مطاعم و ثلاجات و غسالات`,
  description: 'ديانه نقل عفش وانيت نقل اثاث بجميع مناطق الرياض',
  fullDescription: 'نقل عفش بأفضل الأسعار بالرياض مع الفك والتركيب والتغليف',
  heroImage: '/images/hero.webp',
  mobileNumber: '966539387713',
  whatsappNumber: '966539387713',
}

export const ServicesList = [
  {
    id: 1,
    link: '/',
    title: `شراء غرف نوم مستعملة`,
    image: '/images/1.jpeg',
    description: `يعد شراء غرف نوم مستعملة خيارًا ممتازًا للتوفير والحصول على قطع فريدة. تتميز هذه الغرف بتنوع التصاميم والأسعار المنخفضة مقارنة بالأثاث الجديد. من المهم فحص الحالة العامة للأثاث قبل الشراء لضمان جودته. مع القليل من العناية، يمكن أن تضيف هذه الغرف لمسة أنيقة وعملية لمنزلك.`,
  },
  {
    id: 2,
    link: '/',
    title: 'شراء مكيفات مستعملة',
    image: '/images/2.jpeg',
    description: `عد شراء مكيفات مستعملة خيارًا اقتصاديًا ومناسبًا للعديد من الأشخاص. توفر هذه المكيفات أداءً جيدًا بتكلفة أقل مقارنةً بالموديلات الجديدة. عند الشراء، من المهم التأكد من حالة المكيف وفحصه جيدًا للتأكد من عدم وجود أعطال أو تلف. يُفضل طلب معلومات عن عمر المكيف وصيانته السابقة، وكذلك التأكد من كفاءة استهلاكه للطاقة. العديد من المكيفات المستعملة تأتي مع ضمانات، مما يزيد من ثقتك في الشراء. باستخدام مكيفات مستعملة`,
  },
  {
    id: 3,
    link: '/',
    title: 'شراء أجهزة كهربائية',
    image: '/images/3.jpeg',
    description:
      'يعتبر شراء أجهزة كهربائية مستعملة خيارًا ذكيًا يوفر المال ويمنحك إمكانية الحصول على أجهزة ذات جودة عالية بأسعار معقولة. تشمل هذه الأجهزة الثلاجات، الغسالات، الميكروويف، والمكيفات، وغيرها. عند الشراء، يُفضل التحقق من حالة الجهاز وأدائه، بالإضافة إلى طلب معلومات حول عمره وصيانته السابقة. يمكنك أيضًا البحث عن علامات تجارية معروفة لضمان الجودة.',
  },
]

export const MapShareLinks = [
  {
    id: 1,
    title: 'Google',
    url: 'https://google.com',
    image: '/images/google_map_white_small.webp',
  },
  {
    id: 2,
    title: 'Waze',
    url: 'https://waze.com',
    image: '/images/waze_white_small.webp',
  },
  {
    id: 3,
    title: 'Moovit',
    url: 'https://moovit.com',
    image: '/images/moovit_white_small.webp',
  },
]

export const SocialShareLinks = [
  {
    id: 1,
    title: 'Facebook',
    url: 'https://www.facebook.com/profile.php?id=100007001834885&mibextid=ZbWKwL',
    icon: faFacebookF,
  },
  {
    id: 2,
    title: 'Snapchat',
    url: 'https://www.snapchat.com/add/user717749445?share_id=lcK1ZhOLadI&locale=ar-EG',
    icon: faSnapchat,
  },
  {
    id: 3,
    title: 'Instagram',
    url: 'https://www.instagram.com/mohamedsalah7903?igsh=MThtNnFqMnY3dzBoNQ==',
    icon: faInstagram,
  },
]

export const ContactInfo = [
  {
    id: 1,
    name: 'الواتساب',
    href: `https://wa.me/${SiteInfo.whatsappNumber}`,
    icon: faWhatsapp,
    text: `00${SiteInfo.whatsappNumber}`,
  },
  {
    id: 2,
    name: 'الهاتف',
    href: `tel:${SiteInfo.mobileNumber}`,
    icon: faPhone,
    text: `${SiteInfo.mobileNumber}`,
  },
]

export const AboutCompany = [
  {
    id: 1,
    title: `يعتبر شراء الأثاث المستعمل خيارًا متميزًا للعديد من الأشخاص الذين يبحثون عن الجودة والتوفير. توفر الأسواق المختلفة مجموعة واسعة من الأثاث المستعمل، بما في ذلك غرف النوم والمكيفات والأجهزة الكهربائية والمجالس والمطابخ والأثاث المكتبي.`,
  },
  {
    id: 2,
    title: `غرف النوم المستعملة توفر تنوعًا في التصاميم والأحجام، مما يسمح لك بإيجاد ما يناسب ذوقك الشخصي واحتياجاتك. من المهم فحص الأثاث جيدًا للتأكد من حالته، حيث يمكن أن تكون بعض القطع ذات جودة عالية وتحتاج إلى القليل من العناية.`,
  },
  {
    id: 3,
    title: `المكيفات المستعملة تعتبر خيارًا اقتصاديًا، خاصة في المناطق ذات المناخ الحار. يمكن أن توفر لك تجربة مريحة دون تكلفة شراء مكيف جديد. تأكد من التحقق من كفاءة استهلاك الطاقة وعمر الجهاز قبل الشراء.`,
  },
  {
    id: 4,
    title: `الأجهزة الكهربائية المستعملة، مثل الثلاجات والغسالات، تتيح لك الحصول على أجهزة موثوقة بأسعار معقولة. يُفضل البحث عن أجهزة من علامات تجارية معروفة لضمان الجودة والأداء.`,
  },
  {
    id: 5,
    title: `المجالس المستعملة تضيف لمسة من الأناقة والراحة إلى منزلك، حيث تتوفر بتصاميم متنوعة تناسب جميع الأذواق.`,
  },
  {
    id: 6,
    title: `أما المطابخ المستعملة، فتقدم خيارات مثالية لمن يرغب في تجديد مطبخه دون إنفاق الكثير من المال. يمكنك العثور على دواليب وطاولات وأجهزة تناسب احتياجاتك.
    `,
  },
]

export const BlogList = [
  {
    id: 1,
    title: `افضل اسعار شراء اثاث مستعمل في الرياض`,
    description: `نقدم أعلى سعر من أجل شراء مجلس ارضي مستعمل في الرياض نحن رائدون في مجال شراء العفش المستعمل، وإذا كنت تسأل كيف ابيع اثاث مستعمل فالإجابة بسيطة ليس عليك سوى أن تتواصل معنا على الفور من خلال ارقام شراء الاثاث المستعمل بالرياض المتاحة طوال الوقت.
`,
    image: '/images/4.jpeg',
    link: '/',
  },
  {
    id: 2,
    title: `شركة شراء مجالس مستعملة بالرياض
`,
    description: `إذا كان لديك أثاث من الخشب ففريقنا به نجارين ماهرين في نقل هذا الأثاث دون إلحاق أي ضرر به، كما نراعي في افضل شركة شراء اثاث مستعمل بالرياض
    أن يتم وضع غلاف مناسب على العفش لحمايته من الكسر أو الأتربة، ثم يتم نقل العفش بعناية في عربات مجهزة لورشة من أجل إصلاح أي مشكلات فيه.`,
    image: '/images/5.jpeg',
    link: '/',
  },
  {
    id: 3,
    title: ` الأثاث المكتبي المستعمل`,
    description: ` الأثاث المكتبي المستعمل يعتبر حلاً مثاليًا للأشخاص الذين يسعون لتأسيس مكتب منزلي أو تجديد مكاتبهم بأسعار معقولة. توفر هذه القطع بيئة عمل مريحة دون الحاجة إلى ميزانية ضخمة.
`,
    image: '/images/6.jpeg',
    link: '/',
  },
  {
    id: 4,
    title: 'شركة نقل اثاث بالرياض',
    description:
      'تعد شركة نقل عفش بالرياض من الشركات الهامة في المملكة العربية السعودية، وتحديدًا في العاصمة الرياض، حيث توجد العديد من الشركات المتخصصة',
    image: '/images/7.jpeg',
    link: '/',
  },
]
